<script lang="ts">
</script>

<p class="uk-text-italic uk-text-small uk-text-muted">Выключи проксирование на <b>российские</b> ресурсы, чтобы не включать и выключать впн каждый раз</p>
<ol>
    <li>Открой <b>Hiddify</b></li>
    <li>Появится запрос на разрешение создания ВПН конфигрураций. <b>Разреши</b>.</li>
    <li>Должен появиться экран первичной настройки, найди на нем поле <b>Region</b> и выбери <b>Russia (ru)</b></li>
    <li>Нажми <b>Start</b></li>
</ol>
<p>Как сделаешь, возвращайся сюда и нажми на кнопку ниже</p>
