<script lang="ts">
    import { useRouter } from '@dvcol/svelte-simple-router/router';
    import LogoEmoji from '../components/logo-emoji.svelte';

    const router = useRouter();
</script>

<h1 class="uk-heading-small uk-text-center"><LogoEmoji/>&nbsp;&nbspAnywhere VPN</h1>
<button class="uk-button uk-button-default uk-width-1-1 uk-margin-top" onclick={() => router.push({ path: '/' }) }>🏠 На главную</button>

<h2>FAQ</h2>
<div class="uk-child-width-1-2@m" uk-grid>
    <div>
        <h4>Друг/девушка/жена/мама тоже хочет впн. Могу дать свою ссылку?</h4>
        <div>Нет, свою ссылку никому давать нельзя. Сверху есть кнопка для генерации новых ВПН. Используй её.</div>
    </div> 
    <div>
        <h4>У меня есть впн для телефона. Можно его поставить на комп?</h4>
        <div>Да. Выше есть ссылки на скачивания для windows и других платформ. Конфигурацию можешь использовать ту же, что используете на телефоне. Главное, не перепутай, какую конфигурацию ты используешь, а какая выдана друзьям.</div>
    </div>
    <div>
        <h4>ВПН перестал работать/начал барахлить/не грузит/... Что делать?</h4>
        <div>Попробуй отключиться от впн, нажать на иконку "обновить" сверху слева на экране Hiddify. Если не помогло, напиши <a href="https://t.me/ed_asriyan">@ed_asriyan</a> в личку и опиши проблему. Если можешь сделать скриншот ошибки или запись экрана — вообще супер. Пожалуйста, опиши проблему сразу же в первом сообщении.</div>
    </div>
    <div>
        <h4>Отслеживаются ли данные о том какие сайты я посещаю, что смотрю, скачиваю и т.д.?</h4>
        <div>Нет. Ничего не отслеживается и тем более не анализируется и не сохраняется. Логирование трафика пользователей не ведётся. Однако, если ты попытаешься подключиться к серверу не по VLESS протоколу, то это будет залогировано.</div>
    </div>
    <div>
        <h4>Если я начну пользоваться впн, вообще хоть какая-нибудь информация будет генерироваться мной на сервере?</h4>
        <div>Единственное, что будет - это только скорость соединения. Это нужно для того, чтобы выявлять злооупотребения. Например, если какой-нибудь ключ будет выжирать весь гигабитный канал, то этот ключ забаним, чтобы у остальных впн работал стабильно и быстро.</div>
    </div>
    <div>
        <h4>Какая скорость?</h4>
        <div>У самого сервера пропускная способность 1 Gbit, которая делится на всех одновременно подключенных пользователей. Но фактическая скорость может быть ограничена вашим провайдером. Например, если у тебя 100 Mbit, больше ста под впн у вас тоже никак не будет.</div>
    </div>
    <div>
        <h4>Какой протокол?</h4>
        <div>VLESS+REALITY, реализация от <a href="https://xtls.github.io" target="_blank">Project X</a>.</div>
    </div>
    <div>
        <h4>Ты пишешь, что это впн, а на самом деле это просто прокси</h4>
        <div>Верно, но люди знают только слово "впн" и задают не задают лиших вопросов - так как у них всё - "впн".</div>
    </div>
    <div>
        <h4>Исходные код можно посмотреть?</h4>
        <div>Деплой <a href="https://github.com/ed-asriyan/xray-server">тут</a>, а там уже найдёшь ссылки на опенсорс, который деплоется.</div>
    </div>
</div>
